lib/tasks/check_for_update.rake

SELECT "books".* FROM "books" WHERE "books"."table_updated" = $1 ORDER BY "books"."id" ASC LIMIT $2  [["table_updated", true], ["LIMIT", 1000]]
---
  task check_for_updates: :environment do
     puts "inside rake task"
     Book.where(table_updated: true).find_each do |book|