app/workers/book_update_handler.rb

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "table_updated" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["table_updated", false], ["updated_at", "2022-08-01 11:43:53.129120"], ["id", 1]]
---
  def perform(book_id)
    book = Book.find book_id rescue nil
    if book
      #update the boolean flag back to false
      book.update(table_updated: false)